import { Subject } from '../types';

export const subjects: Subject[] = [
  {
    "id": "2-1-1",
    "name": "الثقافة القومية",
    "year": "السنة الثانية",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "2-1-2",
    "name": "اللغة العربية",
    "year": "السنة الثانية",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "2-1-3",
    "name": "مهارات الحاسوب",
    "year": "السنة الثانية",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "2-1-4",
    "name": "كيمياء فيزيائية صيدلانية 1",
    "year": "السنة الثانية",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "2-1-5",
    "name": "كيمياء عضوية 1",
    "year": "السنة الثانية",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "2-1-6",
    "name": "صيدلانيات 1",
    "year": "السنة الثانية",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "2-1-7",
    "name": "لغة إنكليزية 3",
    "year": "السنة الثانية",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "2-2-1",
    "name": "كيمياء تحليلية صيدلانية 1",
    "year": "السنة الثانية",
    "semester": "الفصل الثاني",
    "type": "عملي"
  },
  {
    "id": "2-2-2",
    "name": "صيدلانيات 2",
    "year": "السنة الثانية",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "2-2-3",
    "name": "كيمياء عضوية 2",
    "year": "السنة الثانية",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "2-2-4",
    "name": "عقاقير 1",
    "year": "السنة الثانية",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "2-2-5",
    "name": "كيمياء حيوية 1",
    "year": "السنة الثانية",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "2-2-6",
    "name": "لغة إنكليزية 4",
    "year": "السنة الثانية",
    "semester": "الفصل الثاني",
    "type": "نظري"
  },
  {
    "id": "3-1-1",
    "name": "كيمياء تحليلية صيدلانية 2",
    "year": "السنة الثالثة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "3-1-2",
    "name": "أحياء دقيقة 1",
    "year": "السنة الثالثة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "3-1-3",
    "name": "مناعة",
    "year": "السنة الثالثة",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "3-1-4",
    "name": "عقاقير 2",
    "year": "السنة الثالثة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "3-1-5",
    "name": "تكنولوجيا صيدلانية",
    "year": "السنة الثالثة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "3-1-6",
    "name": "فارماكولوجي 1",
    "year": "السنة الثالثة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "3-1-7",
    "name": "كيمياء حيوية 2",
    "year": "السنة الثالثة",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "3-2-1",
    "name": "كيمياء صيدلية 1",
    "year": "السنة الثالثة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "3-2-2",
    "name": "عقاقير",
    "year": "السنة الثالثة",
    "semester": "الفصل الثاني",
    "type": "عملي"
  },
  {
    "id": "3-2-3",
    "name": "دمويات",
    "year": "السنة الثالثة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "3-2-4",
    "name": "تحليل آلي",
    "year": "السنة الثالثة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "3-2-5",
    "name": "أحياء دقيقة 2",
    "year": "السنة الثالثة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "3-2-6",
    "name": "الإعلام والتسويق الصيدلاني",
    "year": "السنة الثالثة",
    "semester": "الفصل الثاني",
    "type": "نظري"
  },
  {
    "id": "3-2-7",
    "name": "فارماكولوجي 2",
    "year": "السنة الثالثة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "4-1-1",
    "name": "اصطناع دوائي",
    "year": "السنة الرابعة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "4-1-2",
    "name": "سموم",
    "year": "السنة الرابعة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "4-1-3",
    "name": "كيمياء صيدلية 2",
    "year": "السنة الرابعة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "4-1-4",
    "name": "صيدلة صناعية 1",
    "year": "السنة الرابعة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "4-1-5",
    "name": "إسعاف",
    "year": "السنة الرابعة",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "4-1-6",
    "name": "آداب وتشريع صيدلاني",
    "year": "السنة الرابعة",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "4-1-7",
    "name": "فارماكولوجي 3",
    "year": "السنة الرابعة",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "4-1-8",
    "name": "عقاقير تطبيقي",
    "year": "السنة الرابعة",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "4-2-1",
    "name": "صيدلة صناعية 2",
    "year": "السنة الرابعة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "4-2-2",
    "name": "صيدلة المجتمع",
    "year": "السنة الرابعة",
    "semester": "الفصل الثاني",
    "type": "نظري"
  },
  {
    "id": "4-2-3",
    "name": "سموم شرعية",
    "year": "السنة الرابعة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "4-2-4",
    "name": "بيولوجيا جزيئية",
    "year": "السنة الرابعة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "4-2-5",
    "name": "كتابة وصياغة علمية",
    "year": "السنة الرابعة",
    "semester": "الفصل الثاني",
    "type": "نظري"
  },
  {
    "id": "4-2-6",
    "name": "صيدلة فيزيائية",
    "year": "السنة الرابعة",
    "semester": "الفصل الثاني",
    "type": "نظري"
  },
  {
    "id": "4-2-7",
    "name": "علم الأمراض",
    "year": "السنة الرابعة",
    "semester": "الفصل الثاني",
    "type": "نظري"
  },
  {
    "id": "4-2-8",
    "name": "كيمياء الأغذية ومراقبتها",
    "year": "السنة الرابعة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "5-1-1",
    "name": "كيمياء حيوية سريرية",
    "year": "السنة الخامسة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "5-1-2",
    "name": "صيدلة حيوية وحركية الدواء",
    "year": "السنة الخامسة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "5-1-3",
    "name": "تقانة حيوية",
    "year": "السنة الخامسة",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "5-1-4",
    "name": "رقابة دوائية",
    "year": "السنة الخامسة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "5-1-5",
    "name": "مهارات التواصل الصيدلاني",
    "year": "السنة الخامسة",
    "semester": "الفصل الأول",
    "type": "نظري"
  },
  {
    "id": "5-1-6",
    "name": "ميكروبيولوجيا صيدلية",
    "year": "السنة الخامسة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "5-1-7",
    "name": "ملازمة",
    "year": "السنة الخامسة",
    "semester": "الفصل الأول",
    "type": "نظري + عملي"
  },
  {
    "id": "5-2-1",
    "name": "فارماكولوجيا سريرية",
    "year": "السنة الخامسة",
    "semester": "الفصل الثاني",
    "type": "نظري"
  },
  {
    "id": "5-2-2",
    "name": "وبائيات وصحة عامة",
    "year": "السنة الخامسة",
    "semester": "الفصل الثاني",
    "type": "نظري"
  },
  {
    "id": "5-2-3",
    "name": "كيمياء دوائية",
    "year": "السنة الخامسة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "5-2-4",
    "name": "تغذية وحميات",
    "year": "السنة الخامسة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "5-2-5",
    "name": "صيدلة سريرية وصيدلة مشافي",
    "year": "السنة الخامسة",
    "semester": "الفصل الثاني",
    "type": "نظري + عملي"
  },
  {
    "id": "5-2-6",
    "name": "ملازمة",
    "year": "السنة الخامسة",
    "semester": "الفصل الثاني",
    "type": "نظري"
  }
];
